CamadaLDN/api-load-test.yml
config:
  target: http://localhost:3000
  processor: 'my-functions.js'
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - post:
              url: 'http://server/file/upload'
              beforeRequest: 'addMultipartFormData'
          - get:
              url: '/documents/1'
        count: 100